app/controllers/products_controller.rb

SELECT `products`.* FROM `products`
---
  def index
    @products = Product.all

INSERT INTO `products` (`created_at`, `name`, `price`, `updated_at`) VALUES ('2015-03-02 04:38:26', 'Biryani', 230, '2015-03-02 04:38:26')
---
  def create
    @product = Product.new(product_params)
    authorize! :create, @product
    @product.save

SELECT `products`.* FROM `products` WHERE `products`.`id` = 1 LIMIT 1
---
    def set_product
      @product = Product.find(params[:id])